[
{
  "title": "Arctic Expedition 2016",
  "url": "arctic-expedition-2016",
  "subtitle": "Description of my trip to the Greenlandic and Canadian Arctic",
  "datetime": "29 September, 2016",
  "cover-image": "assets/image-posts/arctic-expedition-2016-cover.jpg",
  "text": "<p>Back from the Heaven on the planet, The Arctic!!</p><br><p>SOI Arctic expedition 2016 (Canada and Greenland)</p><br><p>Although it's been quite a few days since I returned, it took me quite a while to get back to India mentally from the mind-blowing, amazing, and enthralling experience I had at the Arctic. I could have never imagined that I would actually travel so far and be at a place that cannot be described by any tongue or language. This was by far, the most enlightening experience of my life.</p><br><p>Being in such an amazing place was an out-of-this-world experience for me. They say you can visit a place by studying or reading about it, but I realized that this was nowhere close to the truth! No amount of pictures or videos I have taken can ever describe my experience!!</p><br><p>Before leaving, I was reluctant as I was the only one from my country, but the amazing friends and people I met there made me forget everything, and they became my second family, which I miss badly after coming back. I cannot express enough gratitude to you all who pulled me up when I was drowning, who were there waiting for me when I slid down headfirst, and who taught me so much and kept me happy and feeling alive all the time.</p><br><p>We lived on the amazing cruise ship, MS Ocean Endeavor, for two weeks, experienced sunshine at 3 am at night, had a concert in the middle of a sea with three humpback whales spraying water just by our side. We climbed mountains, we swam in the freezing water, we flew over glaciers, we saw glaciers breaking and falling in the water just 100 meters away from us, we walked on the glaciers, and we met people, amazing people.</p><br><p>I went to the Arctic in the hopes of studying climate change, but I learned much more than that. I came to know about the Inuit, the natives of the Arctic, and my respect for them has reached beyond explanation for the lives they lead and the courage they possess. Nonetheless, they are the happiest and most welcoming people I ever met. Also, this was the first time I met so many amazing people in such a short span of time who inspired me by their work and dedication. I made amazing friends and met people of my age who have done so much for their communities and people.</p><br><p>It is not really common that a well-dressed and smiling person walks into the room out of nowhere and everyone just fails to acknowledge what they just saw! And this, ladies and gentlemen, was the Prime Minister of Canada, Mr. Justin Trudeau! You know that it is not a common expedition when the Prime Minister of Canada wishes you farewell for an expedition!</p><br><p>The staff comprised as if each precious gem from the world was collected and engraved in a single crown! I met amazing historians, photographers, Inuit elders, scientists, biologists, educators, Everest conquerors, people who swam on the backs of whales, and inspiring amazing individuals from around the world.</p><br><p>We all were from different places and spoke different tongues, but we had the same mentality: that of bringing change to the planet, and that's what inspired us to do more and better. Ever since coming back, I feel more energetic and inspired to work on issues, and I believe that this expedition is just a beginning of the amazing things that are yet to ensue. It is my responsibility of being a part of this expedition.</p><br><p>Thank you everyone for your optimism and support for me.</p><br><p>Lots of work for us to do for the planet. I have returned home now, but still have miles to go before I sleep!</p>"
},
{
  "title": "A year in Japan 2018",
  "url": "a-year-in-japan-2018",
  "subtitle": "Reflections on a year of learning and growth in Japan.",
  "datetime": "January 14, 2019",
  "cover-image": "assets/image-posts/a-year-in-japan-2018-cover.jpg",
  "text": "At the moment of writing this, there lies a letter from the government of the city congratulating me for entering adulthood, with an invitation for a celebration ceremony early tomorrow; and I sit here in the middle of this cold night, watching snow fall, realizing the fact that just a while ago, I could have never comprehended that I would even have been here. I have almost completed a year here in Japan, although it might have been a year where I gave the least output I ever have because of unbelievably tight schedules, but I shall call it the year when I learned the most I could ever have had.<br><br>I learned the values of discipline, self-devotion for the overall good of society from the Japanese, and how killing your fear is done by facing it head-on. How do I know this? I am the same person who was trying to body surf after jumping into the rapids from a raft, not knowing how to swim and was pulled out from a Canadian river half-drowned last year; and I am the same guy who jumped in an almost frozen Japanese river on this New Year’s Eve with 6000 people cheering on both sides, and this time, I was not pulled out, I pulled myself out; and I believe this is progress.<br><br>I want to thank all the amazing people I met this year. I find a hidden genius in everyone I meet here, and I consider it a rather pleasant opportunity to have met you all. To my friends and family I couldn’t have had a word with recently because of the unbelievably busy schedules due to living and getting used to this new side of the world, I have always considered you with me, and I shall never forget that you are giants whose shoulders I climbed to reach here.<br><br>I want to thank the club of the National Rugby Team of Osaka University for letting me be a part of you all this time. I never knew I could be part of a team which spoke a language I didn’t understand, played a game I didn’t know, and lived a life I never did. And after being with you all through the practices or the matches with other national teams of Japanese universities, I consider myself to have made huge progress. I knew this game was all blood and injuries, but I never knew how good the blood and injuries felt when they are for the sake of my team. Thank you for your enormous support.<br><br>When I jumped in the freezing river this year, the water indeed was numbingly cold, but I felt a warmth, a sense of love from this city of Osaka, and I guess this love might just stop me from going back to Tokyo, or moving somewhere else. To everyone who was with me by my shoulder to jump, or those who were out keeping an eye on me, thank you. You are the reason I made it happen, and I shall ever be grateful to you for that. Thank you Fernando, Astrid, Ale, Russo, Ryo, Jules, Ruby, Shota and everyone for being there during the plunge.<br><br>I came to Japan to fall in love with this country, and I indeed did, but what I never knew was that I would fall in love with my country all over again, although my heart beats in languages I never knew it would.<br><br>Looking forward to giving back to the best of my ability for all I have received.<br><br>Thank you for everything, everyone, all I feel is utter gratitude.<br><br>Wish you all a prosperous new year!"
},
{
  "title": "Back from Japan: An Incredible Experience",
  "url": "back-from-japan-incredible-experience",
  "subtitle": "Reflecting on an amazing 9-day trip to Osaka, Kyoto, and Tokyo.",
  "datetime": "March 19, 2025",
  "cover-image": "assets/image-posts/japan-trip-cover.jpg",
  "text": "Last week, I finally returned from Japan. This was actually the craziest and best experience I’ve ever had in my life. I really run out of words expressing Japan and can talk for hours about my experience. The culture, hospitality, nature of the people, technology, greenery... I really gotta say that Japan tops in everything! I visited Osaka, Kyoto, and Tokyo, each city a whole new world in itself. The people are so hospitable that they come out of their stores and wander around with you in case you ask for help.<br><br>Every little thing has so much innovation in it. You’ll find robots in showrooms and traffic areas. Everything is friendly for the physically challenged and blind. I was awestruck when I saw Braille on a Pepsi can.<br><br>There are loads of vending machines, everywhere. Another thing I found surprising was that there were some shops without shopkeepers. There are fruit baskets with cost slips and a bowl nearby, and I actually saw people picking up the baskets and putting the money in the bowl, some even taking change! I really can’t imagine how this mentality is fostered in their minds; I mean, the idea of stealing from such a shop is actually new to them, and I guess that’s what makes you special, Japan.<br><br>Amazing management, waste disposal, and resource balance systems power the country. It’s actually the mentality of the people that has led this country to being the best in the world. And of course, never forget to bring your sunglasses at night in Tokyo! You really can’t put off your sunglasses at night.<br><br>The best experience, squashed into 9 days: the bullet train travel, hiking Mt. Tsukuba, catching a glimpse of Mt. Fuji from the airplane, chopsticks, kimonos, and so much more!<br><br>I guess I should make it short, so this was the briefest I could say about Japan!<br><br>Here are some pics from Japan, including the bullet train, Mt. Fuji from the plane, and a night view of Japan.<br><br>Watashi nihonga daisuki!!<br><br>Thank you all so much for always supporting my endeavors. Really, I can’t imagine all this could have happened without love and support from each one of you. Arigatou Gozaimasu (Thank you)"
},
{
  "title": "Designing the Shiftencho API access hierarchy",
  "url": "designing-the-shiftencho-api-access-hierarchy",
  "subtitle": "How we designed a scalable and maintainable user access hierarchy for the Shiftencho shift management system.",
  "datetime": "October 20, 2020",
  "cover-image": "assets/image-posts/shiftencho-api-design-cover.jpg",
  "text": "When I was working with MPI inc. developing Shiftencho, a shift management system, we had this problem where we had to design a hierarchy of the users respective to their job positions, and restrict their access to some particular functions depending on their hierarchy. The problem was that all the request logic lived in one file, and we did not want to disintegrate the functions with respect to their hierarchy, since it would just increase the complexity, and in some places, fail the DRY (Don't Repeat Yourself) commandment we follow so strictly in programming. We also had to keep in mind the scalability so that new positions and roles would not hurt the integrity of the code, and nobody should ever need to touch the actual logic and the code in case the power of a particular job position increases or decreases.<br><br>For hierarchy, I assigned every single user to a particular integer which we called power integer, in the ascending order of their position: 1 for the manager, 2 for the salaryman, 3 for the part-time worker, and so on.<br><br>Now, every time a request was made, we would read the cookie, check who’s logged in, then check the power integer of the user. We would then send the power integer, the request data, and request types to the API handler.<br><br>The API handler is like the front desk of a hotel; it has the records of all the rooms and who belongs where. If a request was made which wasn’t allowed for a user’s power integer, it would get declined. If there is no power integer, a huge number would get assigned as the power variable which would define a non-logged-in user, and thus only the basic roles, like the ability to sign up or log in, would be available.<br><br>So, for example, if someone makes a malicious request to send a message from an account without being logged in, they would be assigned a power integer of 999, and the request will get declined. If they want to log in, that power would be available, and then their password would be salted and hashed and compared to the hash in the database. Once logged in, an expirable record will be made, and thus all requests will be validated in the backend itself after making a backend check of the power variable of the request.<br><br>For scalability, the solution I worked up was derived from something I learned in 7th grade, when I was learning the original BASIC language. We had to write the order of the code as numbers before writing the statements, so:<br>1 var a = 2<br>2 var a = a+2<br>3 goto 2<br>was something it looked like. But in case we wanted to add more code in between, we would have to renumber everything. So, to prevent that, we wrote the order in increments of 10 to allow more code in between.<br><br>That’s exactly what we did: 0 was the god position, who had the power to use all requests; 1 was the owner; 5 was the store manager; 21 was the permanent worker; 51 was the power of the part-time worker; and so on.<br><br>Why did I not use floats and just stack a new decimal tenth for every power, one might ask? Because floats would have unnecessarily made the code complex for the new programmers, AND floating-point comparisons are slower than integers in the database. And since every single request required a comparison, using floats would have been an unnecessary burden on the database.<br><br>For the changeability of the powers, I added a config file which was a dictionary that the actual code read every time to see which requests are available to which users. Thus, in case of changing powers, just editing the config would entirely change how the logic was handled, so no one ever needs to touch up on the code every time the roles changed.<br><br>A pretty interesting challenge, but well solved."
},
{
  "title": "Get in the trade - etching circuit boards",
  "url": "get-in-the-trade-etching-circuit-boards",
  "subtitle": "A look back at the childhood hobby of designing and etching circuit boards.",
  "datetime": "November 15, 2018",
  "cover-image": "assets/image-posts/etching-circuit-boards-cover.jpg",
  "text": "I have spent a pretty decent amount of my childhood designing and etching circuit boards. I designed all sorts of boards for simple circuits like rectifiers, water level indicators, light triggers, sound triggers, and voltage converters. Of course, the task seemed pretty daunting at first, but once you get the hang of it, jumpers (almost) become a thing of the past.<br><br>The way etching works is pretty easy, and I shall try to explain it in layman’s terms here. There is a wooden or plastic (with a high melting point) board with a layer of copper on it. You draw tracks on the copper with a material that prevents the copper underneath it from getting exposed. Then, the board with the drawn tracks is immersed in a solution (mostly ferric chloride) which can dissolve copper. So, once we throw in the copper board with tracks drawn on it, in a tumbler full of ferric chloride, the parts of copper not covered get dissolved in the solution, and the parts that were covered remain unaffected. Then the board is taken out, and the insulating material washed off with a hard-ish brush to expose the copper again.<br><br>Now we have a board with tracks of copper on it. Now we can drill holes and solder electronic components. First, we design the circuit on paper, take the circuit diagram, and draw it out in a way that there is the least amount of copper dissolved (to keep the dissolving solution usable for as many circuits as possible), the least number of holes drilled, and the least number of jumpers used. Also, we need to remember that since we are using simple electronic components (not for SMD components), we have to drill the holes on the other side of where the component is placed, so we need a mirror image of the circuit we designed. A technique I used was placing an inverted carbon paper on the paper I drew the circuit on, and it drew the circuit on the other side of the paper, mirror imaged.<br><br>Then you copy the mirror image onto the copper board. I used to write it out with nail polish but switched to using whiteout since it was of a better consistency and was easier to use. Then I dropped the board in a solution of ferric chloride for about 40 minutes to an hour and a half, depending on the amount of etching I required, constantly checking the progress. I remember that using gloves is a good idea because ferric chloride will dye everything it comes in contact with in a shade of rusty yellowish-brown, which is very hard to wash off.<br><br>I never used gloves myself though.<br><br>There are times when you can re-track the circuit to reduce the jumpers, and I think that is the very goal of using a Printed Circuit Board (PCB).<br><br>I remember when I heard Wozniak talk about how he spent weeks trying to reduce this one jumper and redesigned the entire circuit board of Apple 2. I could have never related to anything more."
},
{
  "title": "JAPAN, HERE I COME!",
  "url": "japan-here-i-come",
  "subtitle": "Excited to embark on a scientific entrepreneurship program in Japan starting May 16th.",
  "datetime": "2015-05-16",
  "cover-image": "assets/image-posts/japan-here-i-come-cover.jpg",
  "text": "It's been 8 years since I first touched electronics, and I think I have come a long way to get to this place. I have got an invitation from Japan for a scientific entrepreneurship and experience in a two-week program beginning on the 16th of May. Perhaps, this is when, for the first time, I'll call my project, the 7-year-old M.O.W.S. (Machine Intercommunication System), a success. An experience of a lifetime, I'm pretty excited for my first overseas experience, and that too, in Japan! The land of Chopsticks, Hatsune Miku, Doraemon, Kiteretsu, Sci-fi Technology, Sakura, Ramen, Samurais, and Ninjas. I wish to get a new perspective on life from their cute, small eyes.<br><br>I want to thank all of you for supporting me and my overly ambitious thoughts. Special thanks to Rev. Fr. Roby, Sis. Rita, the St. Francis family, all my teachers, Sir Ashish Luthra and family, IAS S. Kahan Singh Pannu, IAS Dr. Inderjeet Singh, DSS Mam Sudeep, CM S. Prakash Singh Badal, Hon'ble President Shri Pranab Mukherjee, my huge base of friends, Mamma, Papa, and my Bro Shubham Dwivedi (and myself).<br><br>Currently working on a new Startup, I aim to change this world forever and for good. It's a huge idea that will make me sweat to the bone but will be worth it. But I guess it's not the right time to disclose it all. Stay tuned!<br><br>So finally, thank you so much everyone for your love and support, and it's only your trust and hope which has made me come this far. It's just the beginning; I guess I have hardly begun. There's a long way up to the zenith, and I can reach up there with your love.<br><br>あなたのすべてを愛して<br>(..Love You All..)"
},
{
  "title": "Designing the smart-suggest Algorithm for Critiker.com",
  "url": "designing-the-smart-suggest-algorithm-for-critiker",
  "subtitle": "Developing a real-time, privacy-focused recommendation algorithm for critiker.com without using user history or cookies.",
  "datetime": "2020-09-01",
  "cover-image": "assets/image-posts/smart-suggest-algorithm-cover.jpg",
  "text": "When launching critiker.com, I was a bit confused on how to get the users to know about the thousands of more pages on the website, and how to do it in a way that the information is relevant to the users, and not just some random data brought to their faces. I had to develop a way to somehow know the user’s activities, but that too without storing the actual personal information of the user, at least that was what was the main motive behind critiker.com was: not storing anyone’s private data and ensuring full anonymity. But at the same time, you have to provide a usable experience to the users of your website. Anonymity without usability would render the site useless.<br><br>I achieved this by developing an algorithm called smart-suggest, an algorithm which does not use any history of the user who is visiting the website, nor does it use cookies. Of course, the website uses cookies for counting users, but that’s it. It does not use cookies to track private information. So, smart-suggest is a real-time algorithm which reads the data on screen and uses Ajax requests to communicate to the APIs of Critiker to decide which suggestions to show, and this even helps in lazy loading, a technique where non-essential parts are loaded after the webpage is loaded so that they don’t cause non-essential slowdowns and the data is served on a priority basis. Thus, since the reading of the on-screen data starts after the webpage is loaded, the suggestions only get loaded once the webpage is rendered, so that the user continues to consume the essential information while the APIs work in the background to generate relevant content. A big plus for SEO (Search Engine Optimization, a method used to improve ranking on search engine rankings). Critiker currently (September 2020) ranks number 1 for the keyword critiker on Google.<br><br>So, how this works is that a pre-decided ratio is stored in the configs of the API, which store the ratio of what data to display with more priority. For example, the University must be a big priority, since a user who looks at the professor of Osaka University must not necessarily need to look at one from Kyoto University, so that is considered, but of course, we leave some freedom for the algorithm to let the user wander around other university pages too. The next priority is the Major, and then perhaps the subjects. Very famous pages must always be there too, so as to keep the user introduced to the common trends and where the conversations are probably heating up. Promoting very nicely rated professors or badly rated professors is a good strategy for the users to stay engaged and get to know the more famous personalities they might probably run into one day, but the algorithm has to take care not to overdo this and rather prioritize relevant information first.<br><br>Thus, using the priority configs, a few compound queries (queries with multiple criteria) are run on the database, with some random variables assigned to each result to mix things up. The database prepares a big list which is then trimmed by another random variable to a displayable size. The necessary HTML and security features are added, and the data is sent to the frontend which injects it at the appropriate spots.<br><br>So, what we have now is a webpage which shows different and new suggestions on every page refresh, but even then, they are very relevant, and the most relevant ones stay unaffected.<br><br>As of September 2020, Critiker uses v3.4 of the smart-suggest algorithm, which works on the same basis with some patches to improve speed, reliability, and security."
},
{
  "title": "Moving to Japan - 2017",
  "url": "moving-to-japan-2017",
  "subtitle": "Receiving a scholarship from the Japanese Government to pursue higher education.",
  "datetime": "August 10, 2017",
  "cover-image": "assets/image-posts/moving-to-japan-2017-cover.jpg",
  "text": "At this very moment of writing this, there lies a letter on my table: a letter from the Ambassador of Japan in India, along with a flight ticket. I have received a benign offer from the prestigious Japanese Government to pursue my higher education in Japan under an unconditional, absolutely sponsored scholarship, with further sponsorship to cover all my expenses in Japan. For the upcoming half a decade or more, I shall be pursuing my higher education with the immense support of the Japanese government. I encountered an amount which I could have never imagined encountering this early in life.<br><br>Looking back, I have learned absolutely so much over all these years. When I first started making things, about 9 years ago, I actually wondered what was the mindset required to go forward in life. I was sort of looking for some magic or rather witchcraft which made winners actually winners. But after all these years of progress in my ambitions and awards, I realized that there never was a shortcut or something of that sort. Perseverance, determination, courage; as cliché as these might sound, are actually what made me what I am today. I went through a plethora of emotions over these years, and here I am, having made a complete circle and back to what I was 9 years ago – full of curiosity, determination, courage, and ambitions. From my very short experience of all these years, this is all I needed to reach this point and will need to go further.<br><br>I never wanted to meet Presidents; I never wanted to win national-level science exhibitions and competitions, neither did I want to work in the lab of a Japanese Nobel laureate or sail on icebreaker cruise ships to the cold, absolutely incredible worlds of the Arctic for mere travel. My goal has always been to improve the lives of the people, and I did everything I could for it, and I never even realized when all these achievements came along. And this day, if it were that I could never get any of those prestigious awards or recognition in my life, I still would have given everything and done everything I have done till now for my beloved people, my country, and this beautiful world which gave me life.<br><br>Gratitude, I am afraid if I shall ever be able to express enough. I would have never made it even close to what I am today without the immense support and love from all of you. I met so many great mentors and amazing elders who inspired me by their own greatness and who sometimes personally guided me to overcome the countless difficulties I am so familiar with in this chosen path of mine; my every breath counts as gratitude to you. And to all you dear friends who joined me in a leg of this journey, either in the dozens of exhibitions, the long days and nights of innovating things, the different competitions, my days of school, my journey to Japan or the Arctic, or who never even met me but are still so strongly with me, I cannot ever thank you enough. You made these experiences worth remembering, and you are the reason I am ever so cheerful. Our journeys might be different, but sharing a part of it together is all that matters in the end. Life is so unbelievably short, and we often forget how all the people we meet is nothing but a privilege bestowed upon us. And I, in every way possible, am indeed so thankful for everything.<br><br>Over the years, the only thing I dread and am scared of is contentment. In my opinion, one can never make progress if one is content. Everyone has this choice to make at some point in life: to either be at inner peace and contented and not make progress, or to be dissatisfied and hungry and go for more knowing that one will never be happy no matter what he achieves. Not following the advice of hermits and wise men to go for contentment and peace, I gladly choose being never at peace and being hungry for more no matter what, since it ensures progress. I have been told numerous times by numerous people that no one is perfect, and neither can I nor my works be. I know that, and I might for once even believe it. But that’s the least of the reasons which can stop me from chasing perfection.<br><br>After all, the chase is all that really matters.<br><br>Thank you everyone for being with me, I would have been nowhere without you all. Thank you so much."
},
{
  "title": "July 28, 2015 - Remembering Dr. APJ Abdul Kalam",
  "url": "july-28-2015-remembering-dr-apj-abdul-kalam",
  "subtitle": "A tribute to the late Dr. APJ Abdul Kalam, an inspiration to many.",
  "datetime": "2015-07-28",
  "cover-image": "assets/image-posts/apj-kalam-tribute-cover.jpg",
  "text": "Today is perhaps one of the saddest days for all of us. Respected Dear Kalam Sir passed away, leaving behind a legacy. For me, you have been the biggest inspiration throughout my years in science, and you will always keep me inspired. The role model of simple living and high thinking, Sir, you have always guided me on this path.<br><br>Dear Sir, it really pains me to even think of the fact that I won't get any emails from you now. My wait is over, and my dream to meet you in real life will never be fulfilled now. Ignite awardees will never get to see you now, nor will any inspire awardee. I feel myself lucky to have lived in your era. The Wings of Fire you gave us will enlighten the world, for it is our promise to do so.<br><br>His part is over; now the country is in our hands. My dear science enthusiasts, we have learned a lot from him, and now is the time to act upon his words and make our country, and the world as a whole, a better place to live in. We can't let this inspiration fade inside us; feed it oxygen, make it burn; dig or fly or swim, do whatever it takes, but make the legacy live on and on.<br><br>I am taking this initiative in my hands, and with this promise to make an impact on this world, no matter what I have to give up in this process. You'll always live in my heart, Sir, with that ever-glowing smile inspiring me in every moment of toil.<br><br>Rest in Peace, dear Sir. Our inspiration forever and after."
},
{
  "title": "Remembering the Legendary Dr. Roots",
  "url": "remembering-the-legendary-dr-roots",
  "subtitle": "A heartfelt tribute to the inspiring life and legacy of explorer Dr. Roots.",
  "datetime": "March 20, 2024",
  "cover-image": "assets/image-posts/dr-roots-tribute-cover.jpg",
  "text": "“Do you really mean to say that a 94-year-old explorer sailed with you on a ship and literally climbed all the mountains which you young people did? You are not kidding, right? We know your experiences must have been incredible, but please don’t exaggerate them to a limit that we can’t even believe you” *shows them pictures of THE legendary Dr. Roots after he climbed the mountain in Illulisat* “Yes, he did. He holds a world record for the longest dogsled expedition in the Antarctic and has a mountain range there named after him” *speechless teachers* “HE HAS A MOUNTAIN NAMED AFTER HIM?!!!” “Not a mountain, an entire mountain range” “whh..what? an entire mountain range? Oh My God!.... really? What?!! I thought people like him existed only in books… Oh My God. Sahil, do you even have an idea of how lucky you are! There’s this man who climbs mountains in his 90s and leads expeditions, and here we are in our 40s and we have trouble climbing a flight of stairs” This was the reaction of literally everybody in India after I returned with the tales of this legendary explorer from my SOI expedition. Let’s face it, this was how we all reacted when we met him for the first time!<br><br>I literally can’t believe what made me so fortunate that I could meet in person, a legend like him. The recent email from Sir Geoff about his passing away killed me inside a bit. And it really burns a hole in my heart every time I think that we have lost such a gem from our planet.<br><br>But I am really glad that I have no regrets that I did not miss even a single opportunity to talk to him! I remember our long conversations about the Himalayas and their Geology, his expeditions and travels during the WWII era, and endless other conversations! He was never short of interesting stories! I am so grateful that I had countless conversations with him wherever I saw him alone, in the mudroom, on the zodiac, or even when he used to be busy looking at rocks.<br><br>“What do you think of Mt Fuji?” “It’s an old dormant volcano, one which doesn’t erupt that often. I climbed it with my mother on her birthday!” “What?! You have even climbed it? Why have you been to every place I can think of talking about with you?” “Hah! It is a good sport! Half of the people who climb it don’t even know that it’s a volcano! If they did, the summit wouldn’t be as crowded as it is! People like climbing mountains, not volcanoes!!” And that truly shows us how much he had truly explored and lived each moment of his 94-year-long, yet immortal life. We all might be sad about his passing away, but let’s take a moment to realize how much have we lived. A lot of us never lived a thousandth of what he did, and so many of us never lived for a moment. Let us all inspire ourselves from the legendary life of Dr. Roots and discover the beautiful world around us.<br><br>Paying tribute with words to a person like Dr. Roots is perhaps the least we should do. Words are so fragile, and they will never do justice to pay homage to the great Dr. Roots. He was a man of action, a man who believed in action more than words. Let us think of him every time we climb a high mountain, every time we sail across an ocean, or every time we go to a new place. Heck, let’s explore for his sake. He might not be with us, but his spirit never died; it is very much alive in me, within SOI, within all of us.<br><br>In some cultures of India, we plant fruit trees on someone’s death, and it is said that the very sweetness of the fruits of those trees will remind us of the sweet memories of the person. I will myself plant 10 different trees in his name across various places in India I travel to. And every kid here knows all about you, Dr. Roots, from my stories of my adventures in the north.<br><br>I was the last SOI student to meet him from his last SOI expedition. I was with him on the last day when he was about to leave in his car.<br><br>“Dr. Roots. From our so many conversations; you have inspired me to explore more. I live in the laps of Himalayas and never knew how amazing they were until I met you. I will climb them someday. People back home will never believe how amazing you are!” “Dr. Roots? Hahaha That fancy name again? I told you! My name is Fred! And I am glad that I did. Explore and discover this world around you!” “For the fancy things you have done, ‘Dr. Roots’ doesn’t even sound as fancy!” After he laughed, I shook hands with him. I have shaken hands with presidents of two countries, Nobel laureates, and all sorts of dignitaries, but take my word for this: That was THE firmest handshake I’ve ever received. And that gave me an idea of how strong he was inside, despite being 94 years old! Those mere ten seconds of eye contact felt like such a long time, and I could feel that those eyes had literally seen everything the world could offer. I could see the spirit of laughter, joy, and exploration in his eyes. That handshake still gives me chills when I think about it.<br><br>On the stage of life, there is only so much time we have to play our roles. So why not do it as Fred did? Why not laugh at every moment we can? Why not go and discover every place we can? There is so much we can learn from him, and it is us, the ‘Students on Ice,’ that have to take his voice, his vision, and his life story forward. He might not be alive with us now, but he lives within us as the ever-thirsty spirit of exploration and curiosity. I bow before you, Dr. Roots. You have changed the way I look at the world. Your legacy lives on!<br><br>I don’t know where you are, Dr. Roots, but I am completely sure that wherever you are, you must be riding sleds of dogs or unicorns or whatever animals the other worlds have to offer!"
},
{
  "title": "The Art of Bodging: Getting Things Done Without the 'Right' Tools",
  "url": "the-art-of-bodging-getting-things-done-without-the-right-tools",
  "subtitle": "Reflections on a lifelong fascination with tools and the resourceful skill of 'bodging' to overcome limitations.",
  "datetime": "February 10, 2023",
  "cover-image": "assets/image-posts/art-of-bodging-cover.jpg",
  "text": "I have always been incredibly fascinated by people who are fond of tools; can’t deny that I have been guilty of it myself. In different periods of my life, I have had some strange urge to get deep into some particular art or trade, get in it, and also get deeply invested in collecting the tools to pursue the trade.<br><br>If I revisit 10 years back from now, I can recollect memories of times having a full set of electronic tools, from a simple soldering iron to PCB etching chemicals, design and simulation software; I once started collecting outdoor tools, something which I still have access to. It includes a bunch of tents, all sorts and sizes of lamps and carrying equipment; mountaineering tools; rugby gear; gym equipment; motorcycling gear; kayaking tools, even things from other trades, like how I built myself a portable multi-screen programming setup with multiple keyboards and ergonomic witchcraft.<br><br>I sometimes blame this habit on my humble roots, times when all these tools were not within arm’s reach for me. I knew what they were, how they worked, but since I did not have them, I believed that they would somehow help me do wonders in all these trades. And to make up for it, I designed makeshift tools. Don’t have a soldering iron? Fine, a metal bar, kitchen tongs, and some kitchen stove will warm things enough to put shiny beads of solder on a breadboard. Don’t have an oscilloscope? Why not reduce the voltage of the signal with potential dividers and feed it to an audio jack on the computer and analyze it with some audio signal analyzing freeware.<br><br>This was all for electronics, but bodging goes everywhere you can think of. I remember in the Shinano expedition, an expedition from the summit to the Ocean of the longest river in Japan, I put my bodging skills to the test. Didn’t have a drysuit for sub-freezing temperatures in a half-frozen river? Used used ski wear with almost all holes sealed to prevent any showers from freezing me to death. Layered garbage bags to make makeshift dry bags to keep my clothing warm and dry, and although one of them failed, turning my clothes into a block of ice, for the most part, it did pretty well saving my other gear and electronics, even though my kayak was almost full of water in the rapids. I used long-cut sticks as trekking poles to support my back-breaking backpack in the mountains. No waterproof boat and snow-ready socks? No problem, wear a sock, wear a plastic bag, another sock on the plastic bag. Now it’s waterproof and doesn’t look any different.<br><br>It works for software. I literally wrote software for myself which adds to the functionality of already existing software. One keyboard shortcut for a translation of whatever my professor wrote to me in Japanese, and another one to translate whatever I wrote in English and rewrite the mail again. One single shortcut.<br><br>I remember when the company I am currently working with wanted to switch to NoSQL databases, but with a humongous database and a bunch of 5 devs, we would have had to leave every other task on the table and work on something so huge, it would take days for us to do all the sorting. What was the solution? Use NoSQL ideologies in the SQL database. Multiple copies of everything everywhere, no joins, lots of indexes. And how much time did it take for us to optimize a single query? 5 minutes.<br><br>I learned that learning a skill doesn’t require you to have the finest veteran of the trade come and hold your hand while you are doing it, nor are other expensive books and courses required. It all begins with the sheer will that you want to learn something and do something, and you will find yourself bodging your way out to getting things done.<br><br>I don’t deny that tools make things easier, of course they do; they are there for a purpose. But the very art of bodging your way out and getting things done without the tools will teach you so much more. I remember that when I got all the tools I longed for, for all the trades I did, I felt as if I had earned them. And it also helped me prevent any shiny tool syndrome, a situation when you heavily invest in all the tools for a trade, get bored of it, and the tools never see their full potential, shining and collecting dust in an inventory.<br><br>Also, it prepares you for the apocalypse. I can have any of the gear on me fail in any of the trades I have participated in, and I can build something out of scratch to hold things together until it properly gets fixed, or the bodge becomes the better solution. A bodgy framework I made in a previous company to fix things for the moment was what became the new backbone of the current system I am working on, and the previous framework, something used by millions, was not as good of a solution as the bodge I had accidentally made. This always-ready attitude, I learned from my study of the army, is what projects confidence in a person even when one is in totally foreign, uncontrolled circumstances.<br><br>I believe that bodging has made me who I am. From the mechanical motorized switch which I made with magnets of a speaker and a DVD spinning motor which won me an award from the president of India, to getting sponsorships for international expeditions, just keeping an eye on the goal and doing whatever it takes to solve it, no matter how good or bad-looking the solution was, was all that was ever needed.<br><br>In an inflatable kayak full of repaired punctures, garbage bags for waterproofing with plastic bag-lined socks and a person in ski wear; the only thing which led me to the end of my expedition, or any expedition or challenge I’ve had, was the sheer will and the thirst for getting it done."
},
{
  "title": "The war on PHP",
  "url": "the-war-on-php",
  "subtitle": "A defense of PHP and its enduring relevance in web development.",
  "datetime": "April 05, 2021",
  "cover-image": "assets/image-posts/war-on-php-cover.jpg",
  "text": "“Very Impressive kid, we see you have an experience of 8 years, developing all sorts of web applications. Syntax fluent in all sorts of messed up languages. A great Full stacker we need. But we need to confirm this one thing.<br><br>Did you really mention in your CV that your primary scripting language is, oh no.. PHP?”<br><br>And there went another great developer, in a place he had always been scared of, the situation of his worst nightmares - judgment of skills; all because of some script kiddies and people with aesthetic OCDs with a lot of time on their hands, writing articles and papers bashing developers actually trying to make something, and a language with a teeny-tiny 86% usage on all servers in the rainbow-colored internet backend world.<br><br>In no way do I claim that PHP has all the buzz to it like a newer language, like Go or Kotlin. PHP, alongside Java and Ruby, rather belongs to this group of white-bearded aged languages. Some even consider it to be the C of the internet world, the language which built the foundations of the online world, a language which actually brought the power of the internet to the hands of developers who preferred client-experience, cost, and time over the ever-so enjoyable world of programming in languages with code of comprehensibility which can hurt any modern developer’s ego.<br><br>The problem is with the articles and pages being written in thousands because of how “cool” it is recently to bash anyone or anything related to PHP. It is like dumb high schoolers in their trendy torn jeans bullying their nerd classmate who can literally outsmart them in every possible case and has been topping every class he’s ever been to, but wears glasses which don’t look cool to them.<br><br>Topping, PHP has done a lot, and any usage graph on the internet will tell you that. PHP owns more of the internet than the share of all the other languages on the internet, combined and tripled. (Read that again, “combined and tripled”) And it has done this for so many years in a row. PHP is the easiest language to enter the world of web development, has a framework flavor for every need, and a user base which can fill a small country on its own.<br><br>So, if you ever go down an article bashing PHP, asking why (insert random buzz language which shall die in 5 years) is better than PHP, and you go down in the comments and find no one defending PHP, remember this:<br><br>The PHP developers are on their code editors right now writing code and making all sorts of witchcraft oiling the gears of the internet. They don’t care that get_class() and gettype() are inconsistent and aesthetically unpleasant because of a missing underscore; they care about their clients who have a real budget, want code which actually works, and want a system whose errors, if pasted into Google, spits out a thousand pages of internet help and support from a mature user base who know that their thing will stay cool for a long, long time."
},
{
  "title": "Why I ditched Object Oriented Programming",
  "url": "why-i-ditched-object-oriented-programming",
  "subtitle": "Reflecting on the decision to move away from OOP for performance-intensive tasks like interpreter and compiler development.",
  "datetime": "May 12, 2022",
  "cover-image": "assets/image-posts/why-i-ditched-oop-cover.jpg",
  "text": "I have had a pretty long relationship with code. It goes all the way to the time when I, as a student of electronics, was fascinated by the fact that there were IC’s out there, which had this sort of memory where if you put some particular text in the memory and put the IC on the base again, it would act differently. No other wires needed to be touched, there required no extra components to entirely change the logic of how the circuit performed.<br><br>This was my first relationship with code, which started with PIC16f84A, one of the oldest microcontrollers which made its way to mass production and was not limited to research or military uses. This was a pretty nifty microcontroller, if you designed a PCB for it, you might as well leave some ports for ICSP which stands for In Circuit Serial Programming, you don’t need to take the microcontroller out, just plug in a few wires and connect it to this port called the serial port, something which modern students of computers might have never heard of!<br><br>Now, to make the microcontroller work, you have to think on a very low level, and I had to do all my programming in mostly assembly. Of course, I did look into some other compilers which could compile from a high-level language to the machine code, but I just never could get the hang of thinking of what it would do physically inside the microcontroller. The assembly, on the other hand was beautiful, you knew what value was written where, what bit represented what, and where each individual line of code led you. Indeed, I never recently had the need nor the opportunity to touch assembly except for a few times when I was reverse engineering some softwares with windows based binaries; but the point I am making is that at some points, you really need to know what is happening at the low level, and understand what is being done without the Jargon of overused heirarchies.<br><br>This is what I faced recently when I was trying to write the interpreter of Myna, which is a Japanese character-based programming language. I began with Object Orieted Code, I made classes, then their subclasses and their subclasses. I had this whole bunch of objects sending data here and there and it was all good. But as I was adding more logic and statements to the language, I realised that the code was getting harder and harder to understand, there was a level of heirarchy which even I failed to understand despite the fact that it was me who wrote the whole code all the way from a blank sheet. Also, since this interpreter was written in a scripting language and not a compiled language, Object Oriented setup managed to make it painfully slow, since while interpreting loops, there are parts where you have to run some sections of the code many thousands of times, and even those unnoticeable few miliseconds because of object oriented code turn into litteraly 30 seconds or more which you have to wait out after each interpretation of code to see the result.<br><br>This was the time I realised that Object Oriented methods was a huge mistake for super performance intensive tasks which required code to be build with super strict deadlines, where I was the sole programmer, and tester as well.<br><br>I took the entire codebase and tore it apart, freed all the functions, and started following functional programming and procedural methods and I could have never felt more lightweight. I could focus just on the logic without any programming rules and what was a child of what and all the plethora of features I never needed in the first place.<br><br>Of course, I did emulate some features which I needed, like designing a switching mechanism to quickly switch to the required sections of the code, some independent parts of the codes where completely object oriented since that was on it own perfect.<br><br>It felt like I just came to the programming version of the proof of the old saying of removing stuff rather than adding to make something better.<br><br>It was also the proof that there is no one size fits all answer to any question, neither in the world of programming. A mix of this and that is what makes things perfect, and sometimes, not using the conventions might be the better choice, and might teach you a thing or two!<br><br>I used the aforementioned approach for the compiler of Myna. The principals also came in handy when I redesigned the entire buggy codebase of Shiftencho backend (A shift management system) during a strict deadline. The code was redesgined in 2 days, the original code was more than 3000 lines of code. No code was ever reused."
}
]